УНФ_ТЕСТ/src/InformationRegisters/КП_РеквизитыЭкземпляраПроцесса/КП_РеквизитыЭкземпляраПроцесса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КП_РеквизитыЭкземпляраПроцесса</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ЗначениеРеквизита</name>
    <type>
      <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <comment>Порядок следования реквизита в форме</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>БизнесПроцесс</name>
    <type>
      <types>BusinessProcessRef.КП_БизнесПроцесс</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РеквизитПроцесса</name>
    <type>
      <types>CatalogRef.КП_ДополнительныеРеквизиты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УНФ_ТЕСТ/src/Catalogs/КП_СписокМетаданных/КП_СписокМетаданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КП_СписокМетаданных</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>МетаданныеДокументы</name>
      <description>Документы</description>
    </items>
    <items>
      <name>МетаданныеПроцессыИЗадачи</name>
      <description>Процессы и задачи</description>
    </items>
    <items>
      <name>Свойства</name>
      <description>Свойства</description>
    </items>
    <items>
      <name>МетаданныеСправочники</name>
      <description>Справочники</description>
    </items>
    <items>
      <name>Строки</name>
      <description>Строки</description>
    </items>
    <items>
      <name>Числа</name>
      <description>Числа</description>
    </items>
    <items>
      <name>Булево</name>
      <description>Булево</description>
    </items>
    <items>
      <name>Дата</name>
      <description>Дата</description>
    </items>
  </predefined>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДлина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитТочность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвязьСПВХ</name>
    <comment>Связь с ПланомВидовХарактеристик для Свойств</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УНФ_ТЕСТ/src/InformationRegisters/КП_РеквизитыЭкземпляраПроцесса/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура РеквизитПроцессаПриИзменении(Элемент)
	Запись.ЗначениеРеквизита=КП_Процессы.ПолучитьНачальноеЗначениеРеквизита(Запись.РеквизитПроцесса);
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитПроцессаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ПараметрыФормы=Новый Структура("РежимВыбора", Истина);
	ПараметрыОтбора=Новый Структура("Владелец", ПолучитьВидКорпоративногоПроцесса(Запись.БизнесПроцесс));
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	
	РезультатОткрытия = Неопределено;

	
	ОткрытьФорму("Справочник.КП_ДополнительныеРеквизиты.ФормаСписка", ПараметрыФормы,,,,, Новый ОписаниеОповещения("РеквизитПроцессаНачалоВыбораЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитПроцессаНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    РезультатОткрытия=Результат;
    
    Если НЕ ЗначениеЗаполнено(РезультатОткрытия) Тогда
        Возврат;
    КонецЕсли;
    
    Запись.ЗначениеРеквизита=РезультатОткрытия;

КонецПроцедуры

&НаСервере
Функция ПолучитьВидКорпоративногоПроцесса(БизнесПроцесс)
	Возврат БизнесПроцесс.ВидПроцесса;

КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустой() Тогда
		Элементы.ДекорацияИстория.Доступность=Ложь;
		
	Иначе
		Элементы.РеквизитПроцесса.ТолькоПросмотр=Истина;
		Элементы.ЗначениеРеквизита.АктивизироватьПоУмолчанию=Истина;
		Элементы.Период.ТолькоПросмотр=Истина;
		Элементы.ДекорацияИстория.Доступность=Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияИсторияНажатие(Элемент)
	
	ПараметрыОтбора=Новый Структура;
	ПараметрыОтбора.Вставить("РеквизитПроцесса", Запись.РеквизитПроцесса);
	ПараметрыОтбора.Вставить("БизнесПроцесс", Запись.БизнесПроцесс);
	
	ПараметрыФормы=Новый Структура("Отбор", ПараметрыОтбора);
	
	ФормаИстории=ПолучитьФорму("РегистрСведений.КП_РеквизитыЭкземпляраПроцесса.Форма.ФормаИсторииРеквизита", ПараметрыФормы);
	ФормаИстории.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеРеквизитаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РеквизитПроцесса=Запись.РеквизитПроцесса;
	
	Если НЕ ЗначениеЗаполнено(РеквизитПроцесса) ИЛИ НЕ КП_ОбщееСервер.ЭтоРеквизитДополнительныхСвойств(РеквизитПроцесса) Тогда
		//это обычный реквизит, используем обычную форму выбора
		Возврат;
		
	КонецЕсли;
	
	СтандартнаяОбработка=Ложь;
	
	//откроем форму с установленным отбором
	ПараметрыОтбора=Новый Структура("Владелец", ПолучитьСвязьРеквизитаСПВХ(РеквизитПроцесса));	
	ПараметрыФормы=Новый Структура("Отбор", ПараметрыОтбора);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	ОткрытьФорму("Справочник.ЗначенияСвойствОбъектов.ФормаВыбора", ПараметрыФормы,,,,, Новый ОписаниеОповещения("ЗначениеРеквизитаНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеРеквизитаНачалоВыбораЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
    
    Если ВыбранноеЗначение=Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    Запись.ЗначениеРеквизита=ВыбранноеЗначение;

КонецПроцедуры

&НаСервере
Функция ПолучитьСвязьРеквизитаСПВХ(РеквизитПроцесса)
	Возврат РеквизитПроцесса.ТипРеквизита.СвязьСПВХ;
	
КонецФункции

&НаКлиенте
Процедура ЗначениеРеквизитаАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	Если НЕ ЭтоРеквизитГруппыСвойств() Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Текст) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка=Ложь;
		
	НайденноеЗначение=КП_ОбщееСервер.ПолучитьЗначениеРеквизитаСвойствПоНаименованию(Запись.ЗначениеРеквизита, Текст); 
	
	Если ЗначениеЗаполнено(НайденноеЗначение) Тогда
		ДанныеВыбора=НайденноеЗначение;
		ЭтаФорма[Элемент.Имя]=НайденноеЗначение;     

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗначениеРеквизитаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если НЕ ЭтоРеквизитГруппыСвойств() Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Текст) Тогда
		Возврат;
	КонецЕсли;
	
	НайденноеЗначение=КП_ОбщееСервер.ПолучитьЗначениеРеквизитаСвойствПоНаименованию(Запись.ЗначениеРеквизита, Текст); 
	Если ЗначениеЗаполнено(НайденноеЗначение) Тогда
		ДанныеВыбора=НайденноеЗначение;
		ЭтаФорма[Элемент.Имя]=НайденноеЗначение;
		
	Иначе
		СтандартнаяОбработка=Ложь;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЭтоРеквизитГруппыСвойств()
	Возврат Запись.РеквизитПроцесса.ТипРеквизита.ПринадлежитЭлементу(Справочники.КП_СписокМетаданных.Свойства);
	
КонецФункции
